/**********************************************************************************
 * ファイル名      : gpio_api.h
 * システム名      : x86 プロトタイプＥＣＵ OPE-RA Ver2.0
 * サブシステム名  : GPIO API
 * プログラム名    : ヘッダー
 * CPU TYPE        : 
 * バージョン      : Ver1.00
 * --------------------------------------------------------------------------------
 * 作成者          : 
 * 作成部署        : 
 * 作成日付        : 2009年10月26日 新規作成
 * 更新履歴        : 2010年03月09日
 **********************************************************************************/
#ifndef	_CATS_GPIO_API_H_
#define _CATS_GPIO_API_H_

#define API_OK 0
#define API_NG 1
#define API_BUSY 2

/********************************************************************/
/* 				FPGA 制御レジスタ ビット定義と同じ					*/
/********************************************************************/
#define GPIO_INT  0xFFFF



//------------------------------------------------------------------------------
// FncInitGPIOOutput
//
// 機能名 : GPIO Output 初期設定API
// 機能概要 : 全出力データを“Ｌｏ”状態に初期化する。
//
// 文法:
int FncInitGPIOOutput ( void );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncInitGPIOInput
//
// 機能名 : GPIO Output 初期設定API
// 機能概要 : 全出力データを“Ｌｏ”状態に初期化する。
//
// 文法:
int FncInitGPIOInput ( void );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncGPIOSet
//
// 機能名 : GPIO設定値出力API
// 機能概要 : 指定したチャネルに、設定値を出力する。
//
// 文法:
int FncGPIOSet ( unsigned int ch, unsigned int val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// 	機能			:		FncGPIOSetAll
//	引数					unsigned int - output value
//	戻り値			:		int(0-OK)
//	機能説明		: 		２４チャネル分のＧＰＩＯ出力を設定する
int FncGPIOSetAll( unsigned int val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncGPIOGet
//
// 機能名 : GPIO 入力端子状態取り出しAPI
// 機能概要 : 指定したチャネルの、端子状態を取り出す。
//
// 文法:
int FncGPIOGet ( unsigned int ch, unsigned int *val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// 	機能			:		FncGPIOGetAll
//	引数					unsigned int - output value
//	戻り値			:		int(0-OK)
//	機能説明		: 		１６チャネル分ＧＰＩＯ入力データ読み込む
int FncGPIOGetAll( unsigned int *val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncGPIOIntEnable
//
// 機能名 : GPIO割り込み入力端子制御
// 機能概要 : 指定したGPIO 入力チャネルの割り込み発生有効無効制御を行う。
//
// 文法:
int FncGPIOIntEnable ( unsigned int *sts, unsigned int *lvl );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncGPIOIntEnable2
//
// 機能名 : GPIO割り込み入力端子制御
// 機能概要 : 指定したGPIO 入力チャネルの割り込み発生有効無効制御を行う。
//
// 文法:
int FncGPIOIntEnable2( unsigned int sts, unsigned int lvl );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncGPIOIntSts
//
// 機能名 : GPIO割り込み状態取得API
// 機能概要 : GPIO 入力チャネルの割り込み状態取得を行う。
//
// 文法:
int FncGPIOIntSts ( unsigned int *val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// 	機能			:		FncGPIOIntSts2
//	引数 			:		unsigned int*	-(status array)
//	戻り値			:		int(0-OK)
//	機能説明		: 		１６チャネル分のＧＰＩＯ割り込み状態を取得する
int FncGPIOIntSts2 ( unsigned int *val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncGPIOIntClear
//
// 機能名 :
// 機能概要 :	ＧＰＩＯ割り込みのクリア。
//
// 文法:
int FncGPIOIntClear ( unsigned int val );
//------------------------------------------------------------------------------

/***********************************************************************************
* MODULE         : FncGpioHandlerSet
* ABSTRACT       : GPIO 割り込みのコールバック関数を登録する。
***********************************************************************************/
int FncGpioHandlerSet ( void * );


/***********************************************************************************
* MODULE         : FncGpioHandlerClear
* ABSTRACT       : GPIO 割り込みのコールバック関数を解除する。
***********************************************************************************/
int FncGpioHandlerClear ( void );


#endif // _CATS_GPIO_API_H_
