/**********************************************************************************
 * ファイル名      : powacc_api.h
 * システム名      : x86 プロトタイプＥＣＵ OPE-RA Ver2.0
 * サブシステム名  : pow,acc API
 * プログラム名    : ヘッダー
 * CPU TYPE        : 
 * バージョン      : Ver1.00
 * --------------------------------------------------------------------------------
 * 作成者          : 
 * 作成部署        : 
 * 作成日付        : 2009年09月23日 新規作成
 * 更新履歴        : 2009年12月09日
 **********************************************************************************/
#ifndef _CATS_POWACC_API_H_
#define _CATS_POWACC_API_H_

#define API_OK 0
#define API_NG 1
#define API_BUSY 2

#define CALLBACK_POWER 1
#define CALLBACK_ACC   2

/********************************************************************/
/* 				FPGA 制御レジスタ ビット定義と同じ					*/
/********************************************************************/
#define POWERMONI_INT  (1<<22)
#define ACCMONI_INT  (1<<21)



//------------------------------------------------------------------------------
// FncPowerMoniIntEnable
//
// 機能名 :
// 機能概要 :	パワーマネージャ割り込みを無効/有効にする。
//
// 文法:
int FncPowerMoniIntEnable ( unsigned char val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncPowerMoniIntSts
//
// 機能名 :
// 機能概要 :	パワーマネージャ割り込みのステータス取り込み。
//
// 文法:
int FncPowerMoniIntSts ( unsigned int *sts );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncPowerMoniIntClear
//
// 機能名 :
// 機能概要 :	パワーマネージャ割り込みのクリア
//
// 文法:
int FncPowerMoniIntClear ( void );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncACCMoniIntEnable
//
// 機能名 :
// 機能概要 :	アクセサリーマネージャ割り込みを無効/有効にする
//
// 文法:
int FncAccMoniIntEnable ( unsigned char val );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncACCMoniIntSts
//
// 機能名 :
// 機能概要 :	アクセサリーマネージャ割り込みのステータス取り込み。
//
// 文法:
int FncAccMoniIntSts ( unsigned int *sts );
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// FncACCMoniIntClear
//
// 機能名 :
// 機能概要 :	アクセサリーマネージャ割り込みのクリア
//
// 文法:
int FncAccMoniIntClear ( void );
//------------------------------------------------------------------------------

/***********************************************************************************
* MODULE         : FncVolMoniHandlerSet
* ABSTRACT       : 電圧監視割り込みのコールバック関数を登録する。
***********************************************************************************/
int FncVolMoniHandlerSet ( unsigned char , void * );


/***********************************************************************************
* MODULE         : FncVolMoniHandlerClear
* ABSTRACT       : 電圧監視割り込みのコールバック関数を解除する。
***********************************************************************************/
int FncVolMoniHandlerClear ( unsigned char );


#endif // _CATS_POWACC_API_H_
